app/controllers/keys_controller.rb

INSERT INTO "keys" ("created_at", "interval", "root", "steps", "tuning", "updated_at") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"  [["created_at", "2015-04-03 18:17:33.899374"], ["interval", "I"], ["root", 0], ["steps", "2212221"], ["tuning", "DADGBe"], ["updated_at", "2015-04-03 18:17:33.899374"]]
---
  def create
    @key = Key.new(key_params)
    # @key = Key.build_from_scale(key_params)
    @key.save

SELECT  "keys".* FROM "keys"  WHERE "keys"."id" = ? LIMIT 1  [["id", 1]]
---
  def show
    @key = Key.find(params[:id])